### Query to Analysis

#### User Behavior Analysis
1. **What are the most common rating patterns?**
   - Distribution of ratings (e.g., % of 1-star, 2-star, etc.).
   - Are users generally lenient (high average ratings) or strict?

2. **Which customers are the most active?**
   - Identify top users based on the number of ratings given.

3. **Are there patterns in user activity over time?**
   - Time-series analysis of ratings: Are there seasonal trends in rating activity?
   - Do users rate more movies during certain months or years?

4. **What are the average ratings by users?**
   - Identify users with extreme behavior (always high ratings or always low ratings).

---

#### Movie Popularity and Trends
5. **Which movies are the most rated?**
   - Find the movies with the highest number of ratings.

6. **What is the average rating of movies?**
   - Identify the highest-rated and lowest-rated movies on average.

7. **Are there trends in ratings over time for specific movies?**
   - For popular movies, analyze how ratings change over time.

8. **Does the year of release influence ratings?**
   - Are older or newer movies rated more favorably?

---

#### Correlation and Distribution
9. **What is the correlation between the number of ratings a movie receives and its average rating?**
   - Do more popular movies tend to have higher or lower ratings?

10. **How do ratings vary across different years of movie release?**
    - Distribution of ratings for movies by decade or year.

---

#### Personalized Recommendations
11. **Which genres or types of movies do specific users prefer?**
    - Cluster users based on their rating history and infer preferences.

12. **Can we predict user ratings for a movie?**
    - Build a predictive model to estimate how a user might rate a movie they haven’t seen.

---

#### Temporal Insights
13. **How do rating trends evolve over time?**
    - Are there periods when users tend to give higher or lower ratings?
    - Identify any significant shifts in rating behavior (e.g., during holidays).

14. **Are there specific years or months when certain types of movies receive better ratings?**
    - E.g., holiday-themed movies around December.

---

#### Anomalies and Outliers
15. **Are there users or movies with unusual patterns?**
    - Users who rate all movies the same or movies that receive a disproportionate number of extreme ratings.

16. **What are the least-rated movies?**
    - Identify movies with the lowest number of ratings and explore why.

---

#### Cross-Dataset Insights
17. **Which movies have the highest rating variance?**
    - Movies with polarized opinions (some love, some hate).

18. **Are there trends in ratings by movie release year?**
    - Compare older classic movies with newer ones.

19. **What percentage of users rate movies from every decade?**
    - Explore user engagement with movies across time periods.

20. **What is the relationship between a movie’s release year and the number of ratings it receives?**
    - Do newer movies get rated more frequently?

21. **Which year movie user mostly watched**
    - mostly watched movie name and year

In [1]:
import pandas as pd
import numpy as np
# import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

In [2]:
movie_df = pd.read_csv("../../resources/netflix_movies.csv")

In [3]:

user_rating_df = pd.read_csv("../../resources/Netflix_User_Ratings.csv")

In [4]:
movie_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17770 entries, 0 to 17769
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   MovieId      17770 non-null  int64
 1   ReleaseYear  17763 non-null  float64
 2   MovieTitle   17770 non-null  object
dtypes: float64(1), int64(1), object(1)
memory usage: 416.6+ KB

<p>Checking info of both the df , to get little information about the data we have and their type.</p>
<p>Having proper type of data will help us to work on it better</p>

In [5]:
user_rating_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100480507 entries, 0 to 100480506
Data columns (total 4 columns):
 #   Column   Dtype
---  ------   -----
 0   CustId   int64
 1   Rating   int64
 2   Date     object
 3   MovieId  int64
dtypes: int64(3), object(1)
memory usage: 3.0+ GB

As the Date has 'object' datatype , we have to convert it into date type.

In [6]:
user_rating_df['Date'] = user_rating_df['Date'].astype('date32[pyarrow]')
user_rating_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100480507 entries, 0 to 100480506
Data columns (total 4 columns):
 #   Column   Dtype
---  ------   -----
 0   CustId   int64
 1   Rating   int64
 2   Date     date32[day][pyarrow]
 3   MovieId  int64
dtypes: date32[day][pyarrow](1), int64(3)
memory usage: 2.6 GB

In [7]:
movie_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17770 entries, 0 to 17769
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   MovieId      17770 non-null  int64
 1   ReleaseYear  17763 non-null  float64
 2   MovieTitle   17770 non-null  object
dtypes: float64(1), int64(1), object(1)
memory usage: 416.6+ KB

In [8]:
# lambda x : int(x) if not pd.isna(x) else pd.NA
def process_row(x):
    if not pd.isna(x):
        return int(x)
    return pd.NA

In [9]:
movie_df.head()

   MovieId  ReleaseYear                    MovieTitle
0        1       2003.0               Dinosaur Planet
1        2       2004.0    Isle of Man TT 2004 Review
2        3       1997.0                     Character
3        4       1994.0  Paula Abdul's Get Up & Dance
4        5       2004.0      The Rise and Fall of ECW

In [10]:
# changing RelaseYear type
movie_df['ReleaseYear'] = movie_df['ReleaseYear'].apply(lambda x : int(x) if not pd.isna(x) else pd.NA)
movie_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17770 entries, 0 to 17769
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   MovieId      17770 non-null  int64
 1   ReleaseYear  17763 non-null  object
 2   MovieTitle   17770 non-null  object
dtypes: int64(1), object(2)
memory usage: 416.6+ KB

In [11]:
movie_df.head()

   MovieId ReleaseYear                    MovieTitle
0        1        2003               Dinosaur Planet
1        2        2004    Isle of Man TT 2004 Review
2        3        1997                     Character
3        4        1994  Paula Abdul's Get Up & Dance
4        5        2004      The Rise and Fall of ECW

In [12]:
# changing movie title to string
movie_df['MovieTitle'] = movie_df['MovieTitle'].astype('string')
movie_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17770 entries, 0 to 17769
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   MovieId      17770 non-null  int64
 1   ReleaseYear  17763 non-null  object
 2   MovieTitle   17770 non-null  string
dtypes: int64(1), object(1), string(1)
memory usage: 416.6+ KB

confirming it's type

In [13]:
type(movie_df[:1]['MovieTitle'][0])

str

adding index in movie csv and userrating csv

In [14]:
movie_df['index'] = np.arange(1,movie_df.shape[0]+1) # 
movie_df.set_index('index',inplace=False)
movie_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17770 entries, 0 to 17769
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   MovieId      17770 non-null  int64
 1   ReleaseYear  17763 non-null  object
 2   MovieTitle   17770 non-null  string
 3   index        17770 non-null  int64
dtypes: int64(2), object(1), string(1)
memory usage: 555.4+ KB

In [15]:
user_rating_df['index'] = np.arange(1,user_rating_df.shape[0]+1)
user_rating_df.set_index('index',inplace=False)
user_rating_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100480507 entries, 0 to 100480506
Data columns (total 5 columns):
 #   Column   Dtype
---  ------   -----
 0   CustId   int64
 1   Rating   int64
 2   Date     date32[day][pyarrow]
 3   MovieId  int64
 4   index    int64
dtypes: date32[day][pyarrow](1), int64(4)
memory usage: 3.4 GB

In [16]:
user_rating_df.head()

    CustId  Rating        Date  MovieId  index
0  1488844       3  2005-09-06        1      1
1   822109       5  2005-05-13        1      2
2   885013       4  2005-10-19        1      3
3    30878       4  2005-12-26        1      4
4   823519       3  2004-05-03        1      5

Checking for null values in datasets, as null in data set will not give us usefull information.And it might mislead the ML model

In [17]:
user_rating_df.isna().sum()

CustId     0
Rating     0
Date       0
MovieId    0
index      0
dtype: int64

In [18]:
movie_df.isna().sum()

MovieId        0
ReleaseYear    7
MovieTitle     0
index          0
dtype: int64

As our movie dataset column `ReleaseYear` have some null values and let's check it out and try to get rid of if condition allows else let's try to impute it

In [19]:
movie_df.head()

   MovieId ReleaseYear                    MovieTitle  index
0        1        2003               Dinosaur Planet      1
1        2        2004    Isle of Man TT 2004 Review      2
2        3        1997                     Character      3
3        4        1994  Paula Abdul's Get Up & Dance      4
4        5        2004      The Rise and Fall of ECW      5

In [20]:
movie_df[movie_df['ReleaseYear'].isna()]

       MovieId ReleaseYear                                   MovieTitle  index
4387      4388        <NA>      Ancient Civilizations: Rome and Pompeii   4388
4793      4794        <NA>  Ancient Civilizations: Land of the Pharaohs   4794
7240      7241        <NA>     Ancient Civilizations: Athens and Greece   7241
10781    10782        <NA>                       Roti Kapada Aur Makaan  10782
15917    15918        <NA>                      Hote Hote Pyaar Ho Gaya  15918
16677    16678        <NA>                              Jimmy Hollywood  16678
17666    17667        <NA>                           Eros Dance Dhamaka  17667

In [21]:
movie_df[movie_df['ReleaseYear'].isna()]

       MovieId ReleaseYear                                   MovieTitle  index
4387      4388        <NA>      Ancient Civilizations: Rome and Pompeii   4388
4793      4794        <NA>  Ancient Civilizations: Land of the Pharaohs   4794
7240      7241        <NA>     Ancient Civilizations: Athens and Greece   7241
10781    10782        <NA>                       Roti Kapada Aur Makaan  10782
15917    15918        <NA>                      Hote Hote Pyaar Ho Gaya  15918
16677    16678        <NA>                              Jimmy Hollywood  16678
17666    17667        <NA>                           Eros Dance Dhamaka  17667

I assume these are the authentic movies, so we can search it on internet for their release year.

In [22]:
"""we will inpute the date on the basis of movie titile , so let's first strip the movietitle as it might contains extra space"""
movie_df['MovieTitle'] = movie_df['MovieTitle'].str.strip()

In [23]:
movie_year_map = {'Ancient Civilizations: Rome and Pompeii':int(2001),'Ancient Civilizations: Land of the Pharaohs':int(1995),'Ancient Civilizations: Athens and Greece':int(2010),'Roti Kapada Aur Makaan':1974, 'Hote Hote Pyaar Ho Gaya':1999,'Jimmy Hollywood':int(1994)}

# let's impute the year
for movie in movie_year_map:
    movie_df['ReleaseYear'][movie_df['MovieTitle'] == str(movie)] = movie_year_map[movie]
movie_df.isna().sum()

MovieId        0
ReleaseYear    1
MovieTitle     0
index          0
dtype: int64

In [24]:
movie_df[movie_df['ReleaseYear'].isna()]

       MovieId ReleaseYear          MovieTitle  index
17666    17667        <NA>  Eros Dance Dhamaka  17667

In [25]:
weight_of_na_value = round((movie_df['ReleaseYear'].isna().sum().sum()/movie_df.shape[0]) * 100,2)
weight_of_na_value

0.01

In [26]:
movie_df['ReleaseYear'].isna().sum().sum()

1

As we search over the internet and found out that Movie title `Eros Dance Dhamaka` is not a movie and there is no relase date.
Also it contains only `0.01 %` of weightage.So we can safely drop it.

In [27]:
movie_df.dropna(inplace=True)
movie_df.isna().sum()

MovieId        0
ReleaseYear    0
MovieTitle     0
index          0
dtype: int64

#### Merging both the datasets

In [28]:
user_rating_df.drop(columns=['index'],inplace=True)
user_rating_df.head()

    CustId  Rating        Date  MovieId
0  1488844       3  2005-09-06        1
1   822109       5  2005-05-13        1
2   885013       4  2005-10-19        1
3    30878       4  2005-12-26        1
4   823519       3  2004-05-03        1

In [29]:
movie_df.drop(columns=['index'],inplace=True)
movie_df.head()

   MovieId ReleaseYear                    MovieTitle
0        1        2003               Dinosaur Planet
1        2        2004    Isle of Man TT 2004 Review
2        3        1997                     Character
3        4        1994  Paula Abdul's Get Up & Dance
4        5        2004      The Rise and Fall of ECW

In [30]:
movie_df.duplicated().sum()

0

In [31]:
user_rating_df.duplicated().sum()

0

In [32]:
print("Movie df shape ",movie_df.shape, "\nUser Rating df shape : ",user_rating_df.shape)

Movie df shape  (17769, 3)
User Rating df shape :  (100480507, 4)

In [33]:
user_rating_df.columns

Index(['CustId', 'Rating', 'Date', 'MovieId'], dtype='object')

In [34]:
user_rating_df.rename(columns={'Date':'RatingDate'},inplace=True)
user_rating_df['RatingMonth'] = user_rating_df['RatingDate'].dt.month
user_rating_df['RatingYear'] = user_rating_df['RatingDate'].dt.year
user_rating_df.head()

    CustId  Rating  RatingDate  MovieId  RatingMonth  RatingYear
0  1488844       3  2005-09-06        1            9        2005
1   822109       5  2005-05-13        1            5        2005
2   885013       4  2005-10-19        1           10        2005
3    30878       4  2005-12-26        1           12        2005
4   823519       3  2004-05-03        1            5        2004

In [43]:
# Duming cleaned Datasets
user_rating_df.to_csv('../../resources/Netflix_User_Ratings.csv',index=False)
movie_df.to_csv('../../resources/netflix_movies.csv',index=False)

In [35]:
user_rating_movie_df = pd.merge(user_rating_df,movie_df,how="inner",left_on='MovieId',right_on='MovieId')

In [36]:
print("Merged dataset shape : ",user_rating_movie_df.shape)

Merged dataset shape :  (100480391, 8)

In [37]:
print("Lost rows data : ",user_rating_df.shape[0]-user_rating_movie_df.shape[0])

Lost rows data :  116

In [38]:
user_rating_movie_df.head()

,CustId,Rating,RatingDate,MovieId,RatingMonth,RatingYear,ReleaseYear,MovieTitle
0,1488844,3,2005-09-06,1,9,2005,2003,Dinosaur Planet
1,822109,5,2005-05-13,1,5,2005,2003,Dinosaur Planet
2,885013,4,2005-10-19,1,10,2005,2003,Dinosaur Planet
3,30878,4,2005-12-26,1,12,2005,2003,Dinosaur Planet
4,823519,3,2004-05-03,1,5,2004,2003,Dinosaur Planet

In [39]:
user_rating_movie_df.sort_values(by='CustId',ascending=True,inplace=True)
user_rating_movie_df.head()

,CustId,Rating,RatingDate,MovieId,RatingMonth,RatingYear,ReleaseYear,MovieTitle
11775512,6,4,2005-04-20,2252,4,2005,1992,Bram Stoker's Dracula
99346159,6,3,2005-11-25,17525,11,2005,1957,The Enemy Below
65642591,6,4,2004-09-27,12034,9,2004,1980,The Shining
57693805,6,3,2005-01-12,10554,1,2005,1959,The Diary of Anne Frank
63517351,6,3,2004-09-15,11573,9,2004,1963,The Great Escape

In [ ]:
# dumping merged , cleaned Dataset
# user_rating_movie_df.to_csv('../../resources/user_rating_movie.csv',index=False)

In [41]:
# 100 mb dataset
sample = user_rating_movie_df.sample(frac=0.017,random_state=40)
sample.to_csv("sample_100mb.csv",index=False)

### As Our both the data is cleaned and in desired fomat. Now we can proceed with our data analysis and can find insight into the dataset.